#include <clocale>
#include "iostream"

using namespace std;


/*Напишите робота для коллекторов. В самом начале он спрашивает имя должника и сумму долга,
а затем начинает требовать у него погашения долга до тех пор, пока тот не будет погашен полностью.
Сумма долга должна уменьшаться, если пользователь ввёл сумму, меньшую чем сумма долга.
Если пользователь внёс большую сумму, чем требуется для погашения, выведите сообщение о том,
какой у него остаток на счету после такой операции. Обеспечьте контроль ввода.*/
void task3() {

}